{"zip":"98052-6399","sector":"Technology","fullTimeEmployees":181000,"longBusinessSummary":"Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. Its Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, and Skype for Business, as well as related Client Access Licenses (CAL); Skype, Outlook.com, OneDrive, and LinkedIn; and Dynamics 365, a set of cloud-based and on-premises business solutions for organizations and enterprise divisions. Its Intelligent Cloud segment licenses SQL, Windows Servers, Visual Studio, System Center, and related CALs; GitHub that provides a collaboration platform and code hosting service for developers; and Azure, a cloud platform. It also offers support services and Microsoft consulting services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification on Microsoft products. Its More Personal Computing segment provides Windows original equipment manufacturer (OEM) licensing and other non-volume licensing of the Windows operating system; Windows Commercial, such as volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; Windows Internet of Things; and MSN advertising. It also offers Surface, PC accessories, PCs, tablets, gaming and entertainment consoles, and other devices; Gaming, including Xbox hardware, and Xbox content and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. It sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online stores, and retail stores. It has collaborations with Dynatrace, Inc., Morgan Stanley, Micro Focus, WPP plc, ACI Worldwide, Inc., and iCIMS, Inc., as well as strategic relationships with Avaya Holdings Corp. and wejo Limited. Microsoft Corporation was founded in 1975 and is based in Redmond, Washington.","city":"Redmond","phone":"425 882 8080","state":"WA","country":"United States","website":"https://www.microsoft.com","address1":"One Microsoft Way","industry":"Software Infrastructure","shortName":"Microsoft Corporation","longName":"Microsoft Corporation","symbol":"MSFT","logo_url":"https://logo.clearbit.com/microsoft.com"}
{"zip":"95014","sector":"Technology","fullTimeEmployees":100000,"longBusinessSummary":"Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. It also sells various related services. In addition, the company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; AirPods Max, an over-ear wireless headphone; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, HomePod, and iPod touch. Further, it provides AppleCare support services; cloud services store services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. Additionally, the company offers various services, such as Apple Arcade, a game subscription service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was incorporated in 1977 and is headquartered in Cupertino, California.","city":"Cupertino","phone":"408 996 1010","state":"CA","country":"United States","website":"https://www.apple.com","address1":"One Apple Park Way","industry":"Consumer Electronics","shortName":"Apple Inc.","longName":"Apple Inc.","symbol":"AAPL","logo_url":"https://logo.clearbit.com/apple.com"}
{"zip":"94043","sector":"Communication Services","fullTimeEmployees":156500,"longBusinessSummary":"Alphabet Inc. provides online advertising services in the United States, Europe, the Middle East, Africa, the Asia-Pacific, Canada, and Latin America. The company offers performance and brand advertising services. It operates through Google Services, Google Cloud, and Other Bets segments. The Google Services segment provides products and services, such as ads, Android, Chrome, Google Maps, Google Play, Search, and YouTube; subscription-based products; and Fitbit wearable devices, Google Nest home products, Pixel phones, and other devices, as well as in-app purchases and digital content. The Google Cloud segment offers infrastructure, platform, and other services; Google Workspace that include cloud-based collaboration tools for enterprises, such as Gmail, Docs, Drive, Calendar and Meet; and other services for enterprise customers. The Other Bets segment sells health technology and internet services, as well as licensing and research and development services. The company was incorporated in 1998 and is headquartered in Mountain View, California.","city":"Mountain View","phone":"650 253 0000","state":"CA","country":"United States","website":"https://www.abc.xyz","address1":"1600 Amphitheatre Parkway","industry":"Internet Content & Information","shortName":"Alphabet Inc.","longName":"Alphabet Inc.","symbol":"GOOGL","logo_url":"https://logo.clearbit.com/abc.xyz"}
{"zip":"75039-2298","sector":"Energy","longBusinessSummary":"Exxon Mobil Corporation explores for and produces crude oil and natural gas in the United States and internationally. It operates through Upstream, Downstream, and Chemical segments. The company is also involved in the manufacture, trade, transport, and sale of crude oil, natural gas, petroleum products, petrochemicals, and other specialty products; and manufactures and sells petrochemicals, including olefins, polyolefins, aromatics, and various other petrochemicals. As of December 31, 2020, it had approximately 22,239 net operated wells with proved reserves. The company was founded in 1870 and is based in Irving, Texas.","city":"Irving","phone":"972-940-6000","state":"TX","country":"United States","website":"https://corporate.exxonmobil.com","address1":"5959 Las Colinas Boulevard","fax":"972-940-6143","industry":"Oil & Gas Integrated","shortName":"Exxon Mobil Corporation","longName":"Exxon Mobil Corporation","symbol":"XOM","logo_url":"https://logo.clearbit.com/corporate.exxonmobil.com"}
{"zip":"10018","sector":"Technology","longBusinessSummary":"Datadog, Inc. provides monitoring and analytics platform for developers, information technology operations teams, and business users in the cloud in North America and internationally. The company's SaaS platform integrates and automates infrastructure monitoring, application performance monitoring, log management, and security monitoring to provide real-time observability of customers technology stack. Its platform also provides user experience and network performance monitoring, incident management, and various shared features, such as sophisticated dashboards, advanced analytics, collaboration tools, and alerting capabilities. The company was incorporated in 2010 and is headquartered in New York, New York.","city":"New York","phone":"866 329 4466","state":"NY","country":"United States","website":"https://www.datadoghq.com","address1":"620 8th Avenue","industry":"Software Application","address2":"45th Floor","shortName":"Datadog, Inc.","longName":"Datadog, Inc.","symbol":"DDOG","logo_url":"https://logo.clearbit.com/datadoghq.com"}
{"zip":"94158","sector":"Technology","longBusinessSummary":"Uber Technologies, Inc. develops and operates proprietary technology applications in the United States, Canada, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. It connects consumers with independent providers of ride services for ridesharing services and other forms of transportation services, including public transit, as well as connect riders and other consumers with restaurants, grocers, other stores, and delivery service providers for meal preparation, grocery, and other delivery services. The company operates through four segments: Mobility, Delivery, Freight, and Advanced Technologies Group (ATG) and Other Technology Programs. The Mobility segment provides products that connect consumers with mobility drivers who provide rides in a range of vehicles, such as cars, auto rickshaws, motorbikes, minibuses, or taxis. It also offers Uber for Business, financial partnerships, transit, and vehicle solutions offerings. The Delivery segment allows consumers to search for and discover local restaurants, order a meal, and either pick-up at the restaurant or have the meal delivered, as well as offers grocery and convenience store delivery, and select other goods. The Freight segment connects carriers with shippers on the company's platform and enable carriers upfront, transparent pricing, and the ability to book a shipment. The ATG and Other Technology Programs segment engages in the development and commercialization of autonomous vehicle and ridesharing technologies, as well as Uber Elevate. It has a partnership with DriverDO LLC that allows automotive software companies to offer vehicle logistics and personal mobility. The company was formerly known as Ubercab, Inc. and changed its name to Uber Technologies, Inc. in February 2011. Uber Technologies, Inc. was founded in 2009 and is headquartered in San Francisco, California.","city":"San Francisco","phone":"415 612 8582","state":"CA","country":"United States","website":"https://www.uber.com","address1":"1515 3rd Street","industry":"Software Application","shortName":"Uber Technologies, Inc.","longName":"Uber Technologies, Inc.","symbol":"UBER","logo_url":"https://logo.clearbit.com/uber.com"}
{"zip":"95052-3299","sector":"Technology","fullTimeEmployees":28500,"longBusinessSummary":"Applied Materials, Inc. provides manufacturing equipment, services, and software to the semiconductor, display, and related industries. It operates through three segments: Semiconductor Systems, Applied Global Services, and Display and Adjacent Markets. The Semiconductor Systems segment develops, manufactures, and sells various manufacturing equipment that is used to fabricate semiconductor chips or integrated circuits. This segment also offers various technologies, including epitaxy, ion implantation, oxidation/nitridation, rapid thermal processing, physical vapor deposition, chemical vapor deposition, chemical mechanical planarization, electrochemical deposition, atomic layer deposition, etching, and selective deposition and removal, as well as metrology and inspection tools. The Applied Global Services segment provides integrated solutions to optimize equipment and fab performance and productivity comprising spares, upgrades, services, remanufactured earlier generation equipment, and factory automation software for semiconductor, display, and other products. The Display and Adjacent Markets segment offers products for manufacturing liquid crystal displays; organic light-emitting diodes; and other display technologies for TVs, monitors, laptops, personal computers, electronic tablets, smart phones, and other consumer-oriented devices. The company operates in the United States, China, Korea, Taiwan, Japan, Southeast Asia, and Europe. Applied Materials, Inc. was incorporated in 1967 and is headquartered in Santa Clara, California.","city":"Santa Clara","phone":"408 727 5555","state":"CA","country":"United States","website":"https://www.appliedmaterials.com","address1":"3050 Bowers Avenue","industry":"Semiconductor Equipment & Materials","address2":"PO Box 58039","shortName":"Applied Materials, Inc.","longName":"Applied Materials, Inc.","symbol":"AMAT","logo_url":"https://logo.clearbit.com/appliedmaterials.com"}
{"zip":"94025","sector":"Technology","longBusinessSummary":"Robinhood Markets, Inc. operates financial services platform in the United States. Its platform allows users to invest in stocks, exchange-traded funds (ETFs), options, gold, and cryptocurrencies. The company also offers various learning and education solutions comprise Snacks, a digest of business news stories; Learn, which is a collection of approximately 650 articles, including guides, feature tutorials, and financial dictionary; Newsfeeds that offer access to free premium news from various sites, such as Barron's, Reuters, and The Wall Street Journal; and lists, which allow users to create custom watchlists to monitor securities, ETFs, and cryptocurrencies, as well as cash management services. Robinhood Markets, Inc. was incorporated in 2013 and is headquartered in Menlo Park, California.","city":"Menlo Park","phone":"844 428 5411","state":"CA","country":"United States","website":"https://www.robinhood.com","address1":"85 Willow Road","industry":"Software Infrastructure","shortName":"Robinhood Markets, Inc.","longName":"Robinhood Markets, Inc.","symbol":"HOOD","logo_url":"https://logo.clearbit.com/robinhood.com"}
{"zip":"98109-5210","sector":"Consumer Cyclical","fullTimeEmployees":1608000,"longBusinessSummary":"Amazon.com, Inc. engages in the retail sale of consumer products and subscriptions in North America and internationally. The company operates through three segments: North America, International, and Amazon Web Services (AWS). It sells merchandise and content purchased for resale from third-party sellers through physical and online stores. The company also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Rings, and Echo and other devices; provides Kindle Direct Publishing, an online service that allows independent authors and publishers to make their books available in the Kindle Store; and develops and produces media content. In addition, it offers programs that enable sellers to sell their products on its websites, as well as its stores; and programs that allow authors, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, the company provides compute, storage, database, analytics, machine learning, and other services, as well as fulfillment, advertising, publishing, and digital content subscriptions. Additionally, it offers Amazon Prime, a membership program, which provides free shipping of various items; access to streaming of movies and series; and other services. The company serves consumers, sellers, developers, enterprises, and content creators. Amazon.com, Inc. was incorporated in 1994 and is headquartered in Seattle, Washington.","city":"Seattle","phone":"206 266 1000","state":"WA","country":"United States","website":"https://www.amazon.com","address1":"410 Terry Avenue North","industry":"Internet Retail","shortName":"Amazon.com, Inc.","longName":"Amazon.com, Inc.","symbol":"AMZN","logo_url":"https://logo.clearbit.com/amazon.com"}
{"zip":"95051","sector":"Technology","longBusinessSummary":"NVIDIA Corporation operates as a visual computing company worldwide. It operates in two segments, Graphics and Compute & Networking. The Graphics segment offers GeForce GPUs for gaming and PCs, the GeForce NOW game streaming service and related infrastructure, and solutions for gaming platforms; Quadro/NVIDIA RTX GPUs for enterprise design; GRID software for cloud-based visual and virtual computing; and automotive platforms for infotainment systems. The Compute & Networking segment offers Data Center platforms and systems for AI, HPC, and accelerated computing; Mellanox networking and interconnect solutions; automotive AI Cockpit, autonomous driving development agreements, and autonomous vehicle solutions; and Jetson for robotics and other embedded platforms. The company's products are used in gaming, professional visualization, datacenter, and automotive markets. NVIDIA Corporation sells its products to original equipment manufacturers, original device manufacturers, system builders, add-in board manufacturers, retailers/distributors, Internet and cloud service providers, automotive manufacturers and tier-1 automotive suppliers, mapping companies, start-ups, and other ecosystem participants. NVIDIA has partnership with Google Cloud to create AI-on-5G Lab. NVIDIA Corporation was founded in 1993 and is headquartered in Santa Clara, California.","city":"Santa Clara","phone":"408 486 2000","state":"CA","country":"United States","website":"https://www.nvidia.com","address1":"2788 San Tomas Expressway","industry":"Semiconductors","shortName":"NVIDIA Corporation","longName":"NVIDIA Corporation","symbol":"NVDA","logo_url":"https://logo.clearbit.com/nvidia.com"}
{"zip":"10504","sector":"Technology","longBusinessSummary":"International Business Machines Corporation provides integrated solutions and services worldwide. Its Cloud & Cognitive Software segment offers software for vertical and domain-specific solutions in various application areas; and customer information control system and storage, and analytics and integration software solutions to support client mission on-premise workloads in banking, airline, and retail industries. It offers middleware and data platform software, including Red Hat that enables the operation of clients' hybrid multi-cloud environments; and Cloud Paks, WebSphere distributed, and analytics platform software, such as DB2 distributed, information integration, and enterprise content management, as well as IoT, Blockchain and AI/Watson platforms. The company's Global Business Services segment offers business consulting services; system integration, application management, maintenance, and support services for packaged software; and finance, procurement, talent and engagement, and industry-specific business process outsourcing services. Its Global Technology Services segment provides IT infrastructure and platform services; and project, managed, outsourcing, and cloud-delivered services for enterprise IT infrastructure environments; and IT infrastructure support services. The company's Systems segment offers servers for businesses, cloud service providers, and scientific computing organizations; data storage products and solutions; and z/OS, an enterprise operating system, as well as Linux. Its Global Financing segment provides lease, installment payment, loan financing, short-term working capital financing, and remanufacturing and remarketing services. It has a collaboration with GK Software SE to enhance retail innovation and customer omnichannel experience with hybrid cloud technology; and with Apptio, Inc. The company was formerly known as Computing-Tabulating-Recording Co. The company was incorporated in 1911 and is headquartered in Armonk, New York.","city":"Armonk","phone":"914 499 1900","state":"NY","country":"United States","website":"https://www.ibm.com","address1":"One New Orchard Road","industry":"Information Technology Services","shortName":"International Business Machines","longName":"International Business Machines Corporation","symbol":"IBM","logo_url":"https://logo.clearbit.com/ibm.com"}
{"zip":"10282","sector":"Financial Services","fullTimeEmployees":43900,"longBusinessSummary":"The Goldman Sachs Group, Inc., a financial institution, provides range of financial services for corporations, financial institutions, governments, and individuals worldwide. It operates through four segments: Investment Banking, Global Markets, Asset Management, and Consumer & Wealth Management. The company's Investment Banking segment provides financial advisory services, including strategic advisory assignments related to mergers and acquisitions, divestitures, corporate defense activities, restructurings, and spin-offs; and middle-market lending, relationship lending, and acquisition financing, as well as transaction banking services. This segment also offers underwriting services, such as equity underwriting for common and preferred stock and convertible and exchangeable securities; and debt underwriting for various types of debt instruments, including investment-grade and high-yield debt, bank and bridge loans, and emerging- and growth-market debt, as well as originates structured securities. Its Global Markets segment is involved in client execution activities for cash and derivative instruments; credit and interest rate products; and provision of equity intermediation and equity financing, clearing, settlement, and custody services, as well as mortgages, currencies, commodities, and equities related products. The company's Asset Management segment manages assets across various asset classes, including equity, fixed income, hedge funds, credit funds, private equity, real estate, currencies, and commodities; and provides customized investment advisory solutions, as well as invests in corporate, real estate, and infrastructure entities. Its Consumer & Wealth Management segment offers wealth advisory and banking services, including financial planning, investment management, deposit taking, and lending; private banking; and unsecured loans, as well as accepts saving and time deposits. The company was founded in 1869 and is headquartered in New York, New York.","city":"New York","phone":"212-902-1000","state":"NY","country":"United States","website":"https://www.goldmansachs.com","address1":"200 West Street","industry":"Capital Markets","address2":"29th Floor","shortName":"Goldman Sachs Group, Inc. (The)","longName":"The Goldman Sachs Group, Inc.","symbol":"GS","logo_url":"https://logo.clearbit.com/goldmansachs.com"}
{"zip":"59715","sector":"Technology","fullTimeEmployees":3557,"longBusinessSummary":"Snowflake Inc. provides cloud-based data platform in the United States and internationally. The company's platform offers Data Cloud, an ecosystem that enables customers to consolidate data into a single source of truth to drive meaningful business insights, build data-driven applications, and share data. Its platform is used by various organizations of various sizes in a range of industries. The company was formerly known as Snowflake Computing, Inc. and changed its name to Snowflake Inc. in April 2019. Snowflake Inc. was incorporated in 2012 and is based in Bozeman, Montana.","city":"Bozeman","phone":"844 766 9355","state":"MT","country":"United States","website":"https://www.snowflake.com","address1":"106 East Babcock Street","industry":"Software Application","address2":"Suite 3A","shortName":"Snowflake Inc.","longName":"Snowflake Inc.","symbol":"SNOW","logo_url":"https://logo.clearbit.com/snowflake.com"}
{"zip":"92618","sector":"Consumer Cyclical","fullTimeEmployees":7500,"longBusinessSummary":"Rivian Automotive, Inc. develops and manufactures electric adventure vehicles. It offers five-passenger pickup trucks and sports utility vehicles. The company provides electric SUVs and electric pickup vehicles. The company was founded in 2009 and is based in San Jose, California. It has additional facilities in Irvine, Carson, and Palo Alto, California; Normal, Illinois; Woking, United Kingdom; Plymouth, Michigan; Vancouver, Canada; and Wittman, Arizona.","city":"Irvine","phone":"734 855 4350","state":"CA","country":"United States","website":"https://www.rivian.com","address1":"14600 Myford Road","industry":"Auto Manufacturers","shortName":"Rivian Automotive, Inc.","longName":"Rivian Automotive, Inc.","symbol":"RIVN","logo_url":"https://logo.clearbit.com/rivian.com"}
{"shortName":"Vanguard S&P 500 ETF","longName":"Vanguard S&P 500 ETF","symbol":"VOO","phone":"866-499-8473","longBusinessSummary":"The investment seeks to track the performance of the Standard & Poorâ\u0080\u0098s 500 Index that measures the investment return of large-capitalization stocks.\n The fund employs an indexing investment approach designed to track the performance of the Standard & Poor&#39;s 500 Index, a widely recognized benchmark of U.S. stock market performance that is dominated by the stocks of large U.S. companies. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.","logo_url":""}
{"zip":"94103","sector":"Technology","longBusinessSummary":"Samsara Inc. provides solutions that connects physical operations data to its Connected Operations Cloud in the United States and internationally. The company's Connected Operations Cloud includes Data Platform, which ingests, aggregates, and enriches data from its IoT devices and has embedded capabilities for AI, workflows and analytics, alerts, API connections, and data security and privacy; and applications for video-based safety, vehicle telematics, apps and driver workflows, equipment monitoring, and site visibility. It serves customers across a range of industries, including transportation and logistics, construction, field services, utilities and energy, government, healthcare and education, manufacturing, and food and beverage. The company was founded in 2015 and is based in San Francisco, California.","city":"San Francisco","phone":"415-985-2400","state":"CA","country":"United States","website":"https://www.samsara.com","address1":"South Building","industry":"Software Infrastructure","address2":"4th Floor 350 Rhode Island Street","shortName":"Samsara Inc.","longName":"Samsara Inc.","symbol":"IOT","logo_url":"https://logo.clearbit.com/samsara.com"}
{"zip":"94107","sector":"Technology","longBusinessSummary":"Lyft, Inc. operates a peer-to-peer marketplace for on-demand ridesharing in the United States and Canada. The company operates multimodal transportation networks that offer riders personalized and on-demand access to various mobility options. It provides Ridesharing Marketplace, which connects drivers with riders; Express Drive, a flexible car rentals program for drivers; Lyft Rentals that provides vehicles for long-distance trips; and a network of shared bikes and scooters in various cities to address the needs of riders for short trips. The company also integrates third-party public transit data into the Lyft app to offer riders various transportation options. In addition, it offers autonomous vehicles; concierge for organizations; Lyft Pass that allows organizations to create custom transportation programs; enterprise programs, including monthly ride credits for daily commutes, supplementing public transit by providing rides for the first and last leg of commute trips, late-night rides home, and shuttle replacement rides; and transportation solutions that can be customized for events, such as recruiting events, conferences, celebrations, meetings, and company retreats. The company was formerly known as Zimride, Inc. and changed its name to Lyft, Inc. in April 2013. Lyft, Inc. was incorporated in 2007 and is headquartered in San Francisco, California.","city":"San Francisco","phone":"844 250 2773","state":"CA","country":"United States","website":"https://www.lyft.com","address1":"185 Berry Street","industry":"Software—Application","address2":"Suite 5000","shortName":"Lyft, Inc.","longName":"Lyft, Inc.","symbol":"LYFT","logo_url":"https://logo.clearbit.com/lyft.com"}
{"zip":"15219-2800","sector":"Basic Materials","fullTimeEmployees": 24540,"longBusinessSummary":"United States Steel Corporation produces and sells flat-rolled and tubular steel products primarily in North America and Europe. It operates through four segments: North American Flat-Rolled (Flat-Rolled), Mini Mill, U. S. Steel Europe (USSE), and Tubular Products (Tubular). The Flat-Rolled segment offers slabs, strip mill plates, sheets, and tin mill products, as well as iron ore and coke. This segment serves customers in the service center, conversion, transportation, automotive, construction, container, appliance, and electrical markets. The Mini Mill segment provides hot-rolled, cold-rolled, and coated sheets and electrical products. This segment serves customers in the automotive, appliance, construction, container, transportation, and service center markets. The USSE segment provides slabs, strip mill plates, sheets, tin mill products, and spiral welded pipes. This segment serves customers in the construction, container, appliance and electrical, service center, conversion, oil, gas, and petrochemical markets. The Tubular segment offers seamless and electric resistance welded steel casing and tubing products, as well as standard and line pipe and mechanical tubing products primarily to customers in the oil, gas, and petrochemical markets. The company also engages in the real estate business. United States Steel Corporation was founded in 1901 and is headquartered in Pittsburgh, Pennsylvania.","city":"Pittsburgh","phone":"412 433 1121","state":"PA","country":"United States","website":"https://www.ussteel.com","address1":"600 Grant Street","industry":"Steel","shortName":"United States Steel Corporation","longName":"United States Steel Corporation","symbol":"X","logo_url":"https://logo.clearbit.com/ussteel.com"}
{"zip":"311121","sector":"Consumer Cyclical","fullTimeEmployees": 258578,"longBusinessSummary":"Alibaba Group Holding Limited, through its subsidiaries, provides technology infrastructure and marketing reach to merchants, brands, retailers, and other businesses to engage with their users and customers in the People's Republic of China and internationally. It operates through four segments: Core Commerce, Cloud Computing, Digital Media and Entertainment, and Innovation Initiatives and Others. The company operates Taobao Marketplace, a social commerce platform; Tmall, a third-party online and mobile commerce platform for brands and retailers; Alimama, a monetization platform; 1688.com and Alibaba.com, which are online wholesale marketplaces; AliExpress, a retail marketplace; Lazada, Trendyol, and Daraz that are e-commerce platforms; and Tmall Global and Kaola, which are import e-commerce platforms. It also operates Lingshoutong that connects FMCG manufacturers and their distributors to small retailers; Cainiao Network logistic services platform; Ele.me, an on-demand delivery and local services platform; Koubei, a restaurant and local services guide platform; and Fliggy, an online travel platform. In addition, the company offers pay-for-performance, in-feed, and display marketing services; and Taobao Ad Network and Exchange, a real-time online bidding marketing exchange. Further, it provides elastic computing, database, storage, virtualization network, large-scale computing, security, management and application, big data analytics, machine learning platform, and Internet of Things services. Additionally, the company operates Youku, an online video platform; Alibaba Pictures and other content platforms that provide online videos, films, live events, news feeds, literature, music, and others; Amap, a mobile digital map, navigation, and real-time traffic information app; DingTalk, a business efficiency app; and Tmall Genie, an AI-enabled smart speaker. The company was incorporated in 1999 and is based in Hangzhou, the People's Republic of China.","city":"Hangzhou","phone":"86 571 8502 2088","country":"China","website":"https://www.alibabagroup.com","address1":"969 West Wen Yi Road","fax":"86 571 8526 9066","industry":"Internet Retail","address2":"Yu Hang District","shortName":"Alibaba Group Holding Limited","longName":"Alibaba Group Holding Limited","symbol":"BABA","logo_url":"https://logo.clearbit.com/alibabagroup.com"}
{"zip":"95032","sector":"Communication Services","fullTimeEmployees": 9400,"longBusinessSummary":"Netflix, Inc. provides entertainment services. It offers TV series, documentaries, and feature films across various genres and languages. The company provides members the ability to receive streaming content through a host of Internet-connected devices, including TVs, digital video players, television set-top boxes, and mobile devices. It also provides DVDs-by-mail membership services. The company has approximately 204 million paid members in 190 countries. Netflix, Inc. was founded in 1997 and is headquartered in Los Gatos, California.","city":"Los Gatos","phone":"408-540-3700","state":"CA","country":"United States","website":"https://www.netflix.com","address1":"100 Winchester Circle","industry":"Entertainment","shortName":"Netflix, Inc.","longName":"Netflix, Inc.","symbol":"NFLX","logo_url":"https://logo.clearbit.com/netflix.com"}
{"zip":"66211","sector":"Communication Services","fullTimeEmployees": 3449,"longBusinessSummary":"AMC Entertainment Holdings, Inc., through its subsidiaries, involved in the theatrical exhibition business. The company owns, operates, or has interests in theatres. As of March 12, 2021, it operated approximately 1000 theatres and 10,700 screens in the United States and internationally. The company was founded in 1920 and is headquartered in Leawood, Kansas.","city":"Leawood","phone":"913-213-2000","state":"KS","country":"United States","website":"https://www.amctheatres.com","address1":"One AMC Way","industry":"Entertainment","address2":"11500 Ash Street","shortName":"AMC Entertainment Holdings, Inc","longName":"AMC Entertainment Holdings, Inc.","symbol":"AMC","logo_url":"https://logo.clearbit.com/amctheatres.com"}
{"zip":"76051","sector":"Consumer Cyclical","fullTimeEmployees": 12000,"longBusinessSummary":"GameStop Corp., a specialty retailer, provides games and entertainment products through its e-commerce properties and various stores in the United States, Canada, Australia, and Europe. The company sells new and pre-owned video game platforms; accessories, such as controllers, gaming headsets, virtual reality products, and memory cards; new and pre-owned video game software; and in-game digital currency, digital downloadable content, and full-game downloads, as well as network points cards, and prepaid digital and subscription cards. It also sells collectibles comprising licensed merchandise primarily related to the video game, television, and movie industries, as well as pop culture themes. The company operates its stores and e-commerce sites under the GameStop, EB Games, and Micromania brands; and collectibles stores under the Zing Pop Culture and ThinkGeek brand, as well as offers Game Informer, a print and digital video game publication featuring reviews of new title releases, game tips, and news regarding the video game industry. As of January 30, 2021, it operated 4,816 stores. The company was formerly known as GSC Holdings Corp. GameStop Corp. was founded in 1996 and is headquartered in Grapevine, Texas.","city":"Grapevine","phone":"817 424 2000","state":"TX","country":"United States","website":"https://www.gamestop.com","address1":"625 Westport Parkway","industry":"Specialty Retail","shortName":"GameStop Corporation","longName":"GameStop Corp.","symbol":"GME","logo_url":"https://logo.clearbit.com/gamestop.com"}
{"zip":"N2K 0A7","sector":"Technology","fullTimeEmployees": 3497,"longBusinessSummary":"BlackBerry Limited provides intelligent security software and services to enterprises and governments worldwide. The company leverages artificial intelligence and machine learning to deliver solutions in the areas of cybersecurity, safety, and data privacy; and endpoint security management, encryption, and embedded systems. It offers BlackBerry Spark software platform that includes a suite of security software products and services comprising BlackBerry UEM, BlackBerry Dynamics, and BlackBerry Workspaces solutions; and BlackBerry Spark SDK to promote the evolution of a platform ecosystem by enabling enterprise and independent software vendor developers to integrate the security features of BlackBerry Spark into their own mobile and web applications. The company also provides BlackBerry Internet of Things (IoT) solutions, including BlackBerry QNX, BlackBerry Certicom, BlackBerry Radar, BlackBerry Jarvis, BlackBerry AtHoc, BlackBerry Alert, SecuSUITE, and other IoT applications. As of February 28, 2021, it owned approximately 38,000 worldwide patents and applications. The company has a partnership with the University of Windsor to develop and deliver a cybersecurity curriculum for the university's graduate master's program in applied computing; and an agreement with Amazon Web Services, Inc. to develop and market BlackBerry's IVY, an intelligent vehicle data platform. It has a partnership with Okta, Inc. The company was formerly known as Research In Motion Limited and changed its name to BlackBerry Limited in July 2013. BlackBerry Limited was incorporated in 1984 and is headquartered in Waterloo, Canada.","city":"Waterloo","state":"ON","country":"Canada","website":"https://www.blackberry.com","address1":"2200 University Avenue East","industry":"Software—Infrastructure","shortName":"BlackBerry Limited","longName":"BlackBerry Limited","symbol":"BB","logo_url":"https://logo.clearbit.com/blackberry.com"}
{"zip":"02451","sector":"Industrials","fullTimeEmployees": 181000,"longBusinessSummary":"Raytheon Technologies Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers worldwide. It operates through four segments: Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for aircraft manufacturers and airlines, as well as regional, business, and general aviation; and for defense and commercial space operations. This segment also designs, produces, and supports cabin interior, communications and aviation systems, oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; airborne intelligence, surveillance and reconnaissance systems, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and information management services. The Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon Intelligence & Space segment develops and provides integrated sensor and communication systems for missions, training, and cyber and software solutions to intelligence, defense, federal, and commercial customers. The Raytheon Missiles & Defense segment designs, develops, produces, and sustains integrated air and missile defense systems; defensive and combat solutions; land- and sea-based radars; command, control, communications, and intelligence solutions; and naval and undersea sensor solutions for the U.S. and foreign government customers. The company is headquartered in Waltham, Massachusetts.","city":"Waltham","phone":"781 522 3000","state":"MA","country":"United States","website":"https://www.rtx.com","address1":"870 Winter Street","industry":"Aerospace & Defense","shortName":"Raytheon Technologies Corporati","longName":"Raytheon Technologies Corporation","symbol":"RTX","logo_url":"https://logo.clearbit.com/rtx.com"}
{"zip":"20817","sector":"Industrials","fullTimeEmployees": 114000,"longBusinessSummary":"Lockheed Martin Corporation, a security and aerospace company, engages in the research, design, development, manufacture, integration, and sustainment of technology systems, products, and services worldwide. It operates through four segments: Aeronautics, Missiles and Fire Control, Rotary and Mission Systems, and Space. The Aeronautics segment offers combat and air mobility aircraft, unmanned air vehicles, and related technologies. The Missiles and Fire Control segment provides air and missile defense systems; tactical missiles and air-to-ground precision strike weapon systems; logistics; fire control systems; mission operations support, readiness, engineering support, and integration services; manned and unmanned ground vehicles; and energy management solutions. The Rotary and Mission Systems segment offers military and commercial helicopters; ship and submarine mission and combat systems; mission systems and sensors for rotary and fixed-wing aircraft; sea and land-based missile defense systems; radar systems; the Littoral combat ship; simulation and training services; and unmanned systems and technologies. It also supports government customers in cybersecurity; and delivers communications, and command and control capabilities through mission solutions for defense applications. The Space segment offers satellites; space transportation systems; strategic, advanced strike, and defensive missile systems; and classified systems and services in support of national security systems. This segment also provides network-enabled situational awareness and integrates space and ground-based systems to help its customers gather, analyze, and securely distribute critical intelligence data. Lockheed Martin Corporation was founded in 1912 and is headquartered in Bethesda, Maryland.","city":"Bethesda","phone":"301-897-6000","state":"MD","country":"United States","website":"https://www.lockheedmartin.com","address1":"6801 Rockledge Drive","industry":"Aerospace & Defense","shortName":"Lockheed Martin Corporation","longName":"Lockheed Martin Corporation","symbol":"LMT","logo_url":"https://logo.clearbit.com/lockheedmartin.com"}
{"zip":"30313","sector":"Consumer Defensive","fullTimeEmployees": 80300,"longBusinessSummary":"The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks; water, enhanced water, and sports drinks; juice, dairy, and plantÂ\u0096based beverages; tea and coffee; and energy drinks. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, Fanta, Fresca, Schweppes, Sprite, Thums Up, Aquarius, Ciel, Dasani, glacÃ©au smartwater, glacÃ©au vitaminwater, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, Minute Maid Pulpy, Simply, Ayataka, Costa, dogadan, FUZE TEA, Georgia, Gold Peak, HONEST TEA, and Kochakaden brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.","city":"Atlanta","phone":"404 676 2121","state":"GA","country":"United States","website":"https://www.coca-colacompany.com","address1":"One Coca-Cola Plaza","industry":"Beverages—Non-Alcoholic","shortName":"Coca-Cola Company (The)","longName":"The Coca-Cola Company","symbol":"KO","logo_url":"https://logo.clearbit.com/coca-colacompany.com"}
{"zip":"30339","sector":"Consumer Cyclical","fullTimeEmployees": 500000,"longBusinessSummary":"The Home Depot, Inc. operates as a home improvement retailer. It operates The Home Depot stores that sell various building materials, home improvement products, building materials, lawn and garden products, and dÃ©cor products, as well as provide installation, home maintenance, and professional service programs to do-it-yourself and professional customers. The company also offers installation programs that include flooring, cabinets and cabinet makeovers, countertops, furnaces and central air systems, and windows; and professional installation in various categories sold through its stores and in-home sales programs, as well as acts as a general contractor to provide installation services to its do-it-for-me customers through third-party installers. In addition, it provides tool and equipment rental services. The company primarily serves homeowners; and professional renovators/remodelers, general contractors, handymen, property managers, building service contractors, and specialty tradesmen, such as electricians, plumbers, and painters. It also sells its products online. As of August 10, 2021, the company operated 2,298 Home Depot retail stores in all 50 states, the District of Columbia, Puerto Rico, U.S. Virgin Islands, Guam, 10 Canadian provinces, and Mexico. The Home Depot, Inc. was incorporated in 1978 and is based in Atlanta, Georgia.","city":"Atlanta","phone":"770 433 8211","state":"GA","country":"United States","website":"https://www.homedepot.com","address1":"2455 Paces Ferry Road","industry":"Home Improvement Retail","shortName":"Home Depot, Inc. (The)","longName":"The Home Depot, Inc.","symbol":"HD","logo_url":"https://logo.clearbit.com/homedepot.com"}
{"zip":"72716","sector":"Consumer Defensive","fullTimeEmployees": 2200000,"longBusinessSummary":"Walmart Inc. engages in the operation of retail, wholesale, and other units worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores; membership-only warehouse clubs; ecommerce websites, such as walmart.com, walmart.com.mx, walmart.ca, flipkart.com, and samsclub.com; and mobile commerce applications. The company offers grocery products, including dry grocery, snacks, dairy, meat, produce, deli and bakery, frozen foods, and alcoholic and nonalcoholic beverages, as well as consumables, such as health and beauty aids, pet supplies, household chemicals, paper goods, and baby products; and health and wellness products covering pharmacy, over-the-counter drugs and other medical products, and optical and clinical services. It also provides gasoline stations and tobacco; home improvement, outdoor living, gardening, furniture, apparel, and jewelry, as well as tools and power equipment, housewares, toys, seasonal items, mattresses, and tire and battery centers; and consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. In addition, the company offers fuel and financial services and related products, including money orders, prepaid cards, money transfers, and check cashing and bill payment. It operates approximately 11,400 stores and various e-commerce websites under 54 banners in 26 countries. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.","city":"Bentonville","phone":"479 273 4000","state":"AR","country":"United States","website":"https://www.stock.walmart.com","address1":"702 SW 8th Street","industry":"Discount Stores","shortName":"Walmart Inc.","longName":"Walmart Inc.","symbol":"WMT","logo_url":"https://logo.clearbit.com/stock.walmart.com"}
{"zip":"94538","sector":"Technology","fullTimeEmployees": 15400,"longBusinessSummary":"Lam Research Corporation designs, manufactures, markets, refurbishes, and services semiconductor processing equipment used in the fabrication of integrated circuits. The company offers ALTUS systems to deposit conformal films for tungsten metallization applications; SABRE electrochemical deposition products for copper interconnect transition that offers copper damascene manufacturing; SOLA ultraviolet thermal processing products for film treatments; and VECTOR plasma-enhanced CVD ALD products. It also provides SPEED gapfill high-density plasma chemical vapor deposition products; and Striker single-wafer atomic layer deposition products for dielectric film solutions. In addition, the company offers Flex for dielectric etch applications; Kiyo for conductor etch applications; Syndion for through-silicon via etch applications; and Versys metal products for metal etch processes. Further, it provides Coronus bevel clean products to enhance die yield; Da Vinci, DV-Prime, EOS, and SP series products to address various wafer cleaning applications; and Metryx mass metrology systems for high precision in-line mass measurement in semiconductor wafer manufacturing. The company sells its products and services to semiconductors industry in the United States, China, Europe, Japan, Korea, Southeast Asia, Taiwan, and internationally. Lam Research Corporation was incorporated in 1980 and is headquartered in Fremont, California.","city":"Fremont","phone":"510 572 0200","state":"CA","country":"United States","website":"https://www.lamresearch.com","address1":"4650 Cushing Parkway","industry":"Semiconductor Equipment & Materials","shortName":"Lam Research Corporation","longName":"Lam Research Corporation","symbol":"LRCX","logo_url":"https://logo.clearbit.com/lamresearch.com"}
{"zip":"95054","sector":"Technology","fullTimeEmployees": 15500,"longBusinessSummary":"Advanced Micro Devices, Inc. operates as a semiconductor company worldwide. The company operates in two segments, Computing and Graphics; and Enterprise, Embedded and Semi-Custom. Its products include x86 microprocessors as an accelerated processing unit, chipsets, discrete and integrated graphics processing units (GPUs), data center and professional GPUs, and development services; and server and embedded processors, and semi-custom System-on-Chip (SoC) products, development services, and technology for game consoles. The company provides processors for desktop and notebook personal computers under the AMD Ryzen, AMD Ryzen PRO, Ryzen Threadripper, Ryzen Threadripper PRO, AMD Athlon, AMD Athlon PRO, AMD FX, AMD A-Series, and AMD PRO A-Series processors brands; discrete GPUs for desktop and notebook PCs under the AMD Radeon graphics, AMD Embedded Radeon graphics brands; and professional graphics products under the AMD Radeon Pro and AMD FirePro graphics brands. It also offers Radeon Instinct, Radeon PRO V-series, and AMD Instinct accelerators for servers; chipsets under the AMD trademark; microprocessors for servers under the AMD EPYC; embedded processor solutions under the AMD Athlon, AMD Geode, AMD Ryzen, AMD EPYC, AMD R-Series, and G-Series processors brands; and customer-specific solutions based on AMD CPU, GPU, and multi-media technologies, as well as semi-custom SoC products. It serves original equipment manufacturers, public cloud service providers, original design manufacturers, system integrators, independent distributors, online retailers, and add-in-board manufacturers through its direct sales force, independent distributors, and sales representatives. The company was incorporated in 1969 and is headquartered in Santa Clara, California.","city":"Santa Clara","phone":"408 749 4000","state":"CA","country":"United States","website":"https://www.amd.com","address1":"2485 Augustine Drive","industry":"Semiconductors","shortName":"Advanced Micro Devices, Inc.","longName":"Advanced Micro Devices, Inc.","symbol":"AMD","logo_url":"https://logo.clearbit.com/amd.com"}
{"zip":"95054-1549","sector":"Technology","fullTimeEmployees": 121100,"longBusinessSummary":"Intel Corporation engages in the design, manufacture, and sale of computer products and technologies worldwide. The company operates through CCG, DCG, IOTG, Mobileye, NSG, PSG, and All Other segments. It offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and non-platform or adjacent products, including accelerators, boards and systems, connectivity products, graphics, and memory and storage products. The company also provides high-performance compute solutions for targeted verticals and embedded applications for retail, industrial, and healthcare markets; and solutions for assisted and autonomous driving comprising compute platforms, computer vision and machine learning-based sensing, mapping and localization, driving policy, and active sensors. In addition, it offers workload-optimized platforms and related products for cloud service providers, enterprise and government, and communications service providers. The company serves original equipment manufacturers, original design manufacturers, and cloud service providers. Intel Corporation has a strategic partnership with MILA to develop and apply advances in artificial intelligence methods for enhancing the search in the space of drugs. The company was incorporated in 1968 and is headquartered in Santa Clara, California.","city":"Santa Clara","phone":"408 765 8080","state":"CA","country":"United States","website":"https://www.intel.com","address1":"2200 Mission College Boulevard","industry":"Semiconductors","shortName":"Intel Corporation","longName":"Intel Corporation","symbol":"INTC","logo_url":"https://logo.clearbit.com/intel.com"}
{"shortName":"iShares Semiconductor ETF","longName":"iShares Semiconductor ETF","symbol":"SOXX","phone":"800-474-2737","longBusinessSummary":"The investment seeks to track the investment results of the ICE Semiconductor Index composed of U.S. equities in the semiconductor sector.\n The fund generally will invest at least 80% of its assets in the component securities of its index and in investments that have economic characteristics that are substantially identical to the component securities of its index and may invest up to 20% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The fund is non-diversified.","logo_url":""}
{"shortName":"Invesco Solar ETF","longName":"Invesco Solar ETF","symbol":"TAN","phone":"800-983-0903","longBusinessSummary":"The investment seeks to track the investment results (before fees and expenses) of the MAC Global Solar Energy Index.\n The fund will generally invest at least 90% of its total assets in the securities (including American depositary receipts (â\u0080\u009cADRsâ\u0080\u009d)) that comprise the index. Strictly in accordance with its guidelines and mandated procedures, MAC Indexing LLC compiles, maintains, and calculates the index, which is designed to track the global solar energy equity sector. The fund is non-diversified.","logo_url":""}
{"zip":"94538","sector":"Technology","fullTimeEmployees": 850,"longBusinessSummary":"Enphase Energy, Inc., together with its subsidiaries, designs, develops, manufactures, and sells home energy solutions for the solar photovoltaic industry in the United States and internationally. The company offers semiconductor-based microinverter, which converts energy at the individual solar module level, and combines with its proprietary networking and software technologies to provide energy monitoring and control services. It also offers AC battery storage systems; Envoy communications gateway; and Enlighten cloud-based monitoring service, as well as other accessories. The company sells its solutions to solar distributors; and directly to large installers, original equipment manufacturers, strategic partners, and homeowners, as well as directly the do-it-yourself market through its legacy product upgrade program or online store. Enphase Energy, Inc. was incorporated in 2006 and is headquartered in Fremont, California.","city":"Fremont","phone":"(877) 774-7000","state":"CA","country":"United States","website":"https://www.enphase.com","address1":"47281 Bayside Parkway","industry":"Solar","shortName":"Enphase Energy, Inc.","longName":"Enphase Energy, Inc.","symbol":"ENPH","logo_url":"https://logo.clearbit.com/enphase.com"}
{"shortName":"Aberdeen Standard Physical Gold","longName":"Aberdeen Standard Gold ETF Trust","symbol":"SGOL","phone":"212-918-4954","longBusinessSummary":"The investment seeks to reflect the performance of the price of gold bullion, less the Trustâ\u0080\u0099s expenses.\n The Shares are intended to constitute a simple and cost-effective means of making an investment similar to an investment in gold. An investment in physical gold requires expensive and sometimes complicated arrangements in connection with the assay, transportation, warehousing and insurance of the metal. Although the Shares are not the exact equivalent of an investment in gold, they provide investors with an alternative that allows a level of participation in the gold market through the securities market.","logo_url":""}
{"zip":"M5J 2J1","sector":"Basic Materials","longBusinessSummary":"Sprott Physical Platinum and Palladium Trust is an exchange traded commodity launched and managed by Sprott Asset Management, LP. The fund invests in commodity markets. It invests in physical platinum and palladium bullion in Good Delivery plate or ingot form. Sprott Physical Platinum and Palladium Trust was formed on December 23, 2011 and is domiciled in Canada.","city":"Toronto","phone":"416-943-8099","state":"ON","country":"Canada","website":"https://sprott.com/investment-strategies/physical-bullion-trusts/platinum-and-palladium/net-asset-value-premium-discount/","address1":"Royal Bank Plaza","fax":"416-977-9555","industry":"Other Precious Metals & Mining","address2":"South Tower 200 Bay Street Suite 2700","shortName":"Sprott Physical Platinum and Pa","longName":"Sprott Physical Platinum and Palladium Trust","symbol":"SPPP","logo_url":"https://logo.clearbit.com/sprott.com"}
{"zip":"75202","sector":"Communication Services","fullTimeEmployees": 214840,"longBusinessSummary":"AT&T Inc. provides telecommunication, media, and technology services worldwide. The company operates through Communications, WarnerMedia, and Latin America segments. The Communications segment offers wireless voice and data communications services; video and targeted advertising services; broadband, including fiber, and legacy telephony internet and voice communication; and wireline telecom services. It also sells handsets, wirelessly enabled computers, wireless data cards, and IP-based set-top boxes, as well as various accessories, such as carrying cases and hands-free devices through the company-owned stores, agents, and third-party retail stores. This segment markets its communications services and products under the AT&T, Cricket, AT&T PREPAIDSM, AT&T TV, AT&T Fiber, and DIRECTV brand names. The WarnerMedia segment primarily produces, distributes, and licenses television programming and feature films; distributes home entertainment products in physical and digital formats; and produces and distributes mobile and console games, and consumer products, as well as offers brand licensing services, and advertising services. It also operates cable networks; video on demand streaming platform under the HBO Max and HBO GO names; multichannel pay television services under the HBO and Cinemax; and digital media properties, as well as licenses its content to television networks and over-the-top services. The Latin America segment offers video entertainment and audio programming services under the DIRECTV and SKY brands primarily to residential customers; pay-TV services, including HD sports video content; and postpaid and prepaid wireless services under the AT&T and Unefon brands, as well as sells various handsets through company-owned stores, agents, and third-party retail stores. The company was formerly known as SBC Communications Inc. and changed its name to AT&T Inc. in November 2005. AT&T Inc. was incorporated in 1983 and is headquartered in Dallas, Texas.","city":"Dallas","phone":"210-821-4105","state":"TX","country":"United States","website":"https://www.att.com","address1":"208 South Akard Street","industry":"Telecom Services","shortName":"AT&T Inc.","longName":"AT&T Inc.","symbol":"T","logo_url":"https://logo.clearbit.com/att.com"}
{"zip":"10036","sector":"Communication Services","fullTimeEmployees": 118500,"longBusinessSummary":"Verizon Communications Inc. offers communications, technology, information, and entertainment products and services to consumers, businesses, and governmental entities worldwide. Its Consumer segment provides postpaid and prepaid service plans; internet access on notebook computers and tablets; wireless equipment, including smartphones and other handsets; and wireless-enabled internet devices, such as tablets, and other wireless-enabled connected devices, such as smart watches. It also provides residential fixed connectivity solutions, including internet, video, and voice services; and sells network access to mobile virtual network operators. As of December 31, 2020, it had approximately 94 million wireless retail connections, 7 million broadband connections, and 4 million Fios video connections. The company's Business segment provides network connectivity products, including private networking, private cloud connectivity, virtual and software defined networking, and internet access services; and internet protocol-based voice and video services, unified communications and collaboration tools, and customer contact center solutions. This segment also offers a suite of management and data security services; domestic and global voice and data solutions, including voice calling, messaging services, conferencing, contact center solutions, and private line and data access networks; customer premises equipment; installation, maintenance, and site services; and Internet of Things products and services. As of December 31, 2020, it had approximately 27 million wireless retail postpaid connections and 482 thousand broadband connections. Verizon Communications Inc. has strategic partnerships with Mastercard Incorporated and Project Kuiper. The company was formerly known as Bell Atlantic Corporation and changed its name to Verizon Communications Inc. in June 2000. Verizon Communications Inc. was incorporated in 1983 and is headquartered in New York, New York.","city":"New York","phone":"212 395 1000","state":"NY","country":"United States","website":"https://www.verizon.com","address1":"1095 Avenue of the Americas","industry":"Telecom Services","shortName":"Verizon Communications Inc.","longName":"Verizon Communications Inc.","symbol":"VZ","logo_url":"https://logo.clearbit.com/verizon.com"}
{"zip":"94103","sector":"Technology","fullTimeEmployees": 5477,"longBusinessSummary":"Block, Inc., together with its subsidiaries, creates tools that enables sellers to accept card payments and provides reporting and analytics, and next-day settlement. It provides hardware products, including Magstripe reader, which enables swiped transactions of magnetic stripe cards; Contactless and chip reader that accepts Europay, MasterCard, and Visa (EMV) chip cards and Near Field Communication payments; Square Stand, which enables an iPad to be used as a payment terminal or full point of sale solution; Square Register that combines its hardware, point-of-sale software, and payments technology; Square Terminal, a payments device and receipt printer to replace traditional keypad terminals, which accepts tap, dip, and swipe payments. The company also offers various software products, including Square Point of Sale; Square Appointments; Square for Retail; Square for Restaurants; Square Online and Square Online Checkout; Square Invoices; Square Virtual Terminal; Square Team Management; Square Contracts; Square Loyalty, Marketing, and Gift Cards; and Square Dashboard. In addition, it offers a developer platform, which includes application programming interfaces and software development kits. Further, the company provides Cash App, which enables to send, spend, and store money; and Weebly that offers customers website hosting and domain name registration solutions. It serves in the United States, Canada, Japan, Australia, and the United Kingdom. The company was formerly known as Square, Inc. and changed its name to Block, Inc. in December 2021. Block, Inc. was founded in 2009 and is headquartered in San Francisco, California.","city":"San Francisco","phone":"415 375 3176","state":"CA","country":"United States","website":"https://www.squareup.com","address1":"1455 Market Street","industry":"Software—Infrastructure","address2":"Suite 600","shortName":"Block, Inc.","longName":"Block, Inc.","symbol":"SQ","logo_url":"https://logo.clearbit.com/squareup.com"}
{"zip":"94025","sector":"Communication Services","fullTimeEmployees": 68177,"longBusinessSummary":"Meta Platforms, Inc. develops products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and in-home devices worldwide. It operates in two segments, Family of Apps and Facebook Reality Labs. The Family of Apps segment's products include Facebook, which enables people to connect, share, discover, and communicate with each other on mobile devices and personal computers; Instagram, a community for sharing photos, videos, and private messages; Messenger, a messaging application for people to connect with friends, family, groups, and businesses across platforms and devices; and WhatsApp, a messaging application that is used by people and businesses to communicate in a private way, as well as other services. The Facebook Reality Labs segment provides augmented and virtual reality related consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. Meta Platforms, Inc. was founded in 2004 and is headquartered in Menlo Park, California.","city":"Menlo Park","phone":"650 543 4800","state":"CA","country":"United States","website":"https://investor.fb.com","address1":"1601 Willow Road","industry":"Internet Content & Information","shortName":"Meta Platforms, Inc.","longName":"Meta Platforms, Inc.","symbol":"FB","logo_url":"https://logo.clearbit.com/investor.fb.com"}
{"zip":"78725","sector":"Consumer Cyclical","fullTimeEmployees": 70757,"longBusinessSummary":"Tesla, Inc. designs, develops, manufactures, leases, and sells electric vehicles, and energy generation and storage systems in the United States, China, and internationally. The company operates in two segments, Automotive, and Energy Generation and Storage. The Automotive segment offers electric vehicles, as well as sells automotive regulatory credits. It provides sedans and sport utility vehicles through direct and used vehicle sales, a network of Tesla Superchargers, and in-app upgrades; and purchase financing and leasing services. This segment is also involved in the provision of non-warranty after-sales vehicle services, sale of used vehicles, retail merchandise, and vehicle insurance, as well as sale of products through its subsidiaries to third party customers; services for electric vehicles through its company-owned service locations, and Tesla mobile service technicians; and vehicle limited warranties and extended service plans. The Energy Generation and Storage segment engages in the design, manufacture, installation, sale, and leasing of solar energy generation and energy storage products, and related services to residential, commercial, and industrial customers and utilities through its website, stores, and galleries, as well as through a network of channel partners. This segment also offers service and repairs to its energy product customers, including under warranty; and various financing options to its solar customers. The company was formerly known as Tesla Motors, Inc. and changed its name to Tesla, Inc. in February 2017. Tesla, Inc. was founded in 2003 and is headquartered in Austin, Texas.","city":"Austin","phone":"650-681-5000","state":"TX","country":"United States","website":"https://www.tesla.com","address1":"13101 Harold Green Road","industry":"Auto Manufacturers","shortName":"Tesla, Inc.","longName":"Tesla, Inc.","symbol":"TSLA","logo_url":"https://logo.clearbit.com/tesla.com"}
{"zip":"94107","sector":"Technology","fullTimeEmployees": 2240,"longBusinessSummary":"CloudFlare, Inc. operates a cloud platform that delivers a range of network services to businesses worldwide. The company provides an integrated cloud-based security solution to secure a range of combination of platforms, including public cloud, private cloud, on-premise, software-as-a-service applications, and Internet of Things (IoT) devices. Its security products comprise cloud firewall, bot management, distributed denial of service, IoT, SSL/TLS, secure origin connection, and rate limiting products. The company also offers performance solutions, which include content delivery, intelligent routing, and mobile software development kit, as well as content, mobile, and image optimization solutions. In addition, it provides reliability solutions comprising load balancing, anycast network, virtual backbone, DNS, DNS resolver, and always online solutions that enhances Internet experience and allows customers to run their digital operations efficiently. Further, the company provides Cloudflare internal infrastructure solutions, including on-ramps, which connect users, devices, or locations to Cloudflare's network; and filters, which are the products that protect, inspect, and privilege data. Additionally, it offers developer-based solutions, such as serverless computing/programmable network, website development, domain registration, Cloudflare apps, and analytics; Consumer DNS Resolver, a consumer application to browse the Internet; and Consumer VPN for consumers designed to secure and accelerate traffic on mobile devices. The company serves customers in technology, healthcare, financial services, consumer and retail, and non-profit industries, as well as government. It has a strategic agreement with Baidu, Inc. and JD Cloud & AI. CloudFlare, Inc. was incorporated in 2009 and is headquartered in San Francisco, California.","city":"San Francisco","phone":"888 993 5273","state":"CA","country":"United States","website":"https://www.cloudflare.com","address1":"101 Townsend Street","industry":"Software—Infrastructure","shortName":"Cloudflare, Inc.","longName":"Cloudflare, Inc.","symbol":"NET","logo_url":"https://logo.clearbit.com/cloudflare.com"}
{"zip":"19801","sector":"Technology","fullTimeEmployees": 2781,"longBusinessSummary":"Coinbase Global, Inc. provides financial infrastructure and technology for the cryptoeconomy. It offers the primary financial account in the cryptoeconomy for retail users; a marketplace with a pool of liquidity for transacting in crypto assets for institutions; and technology and services that enable ecosystem partners to build crypto-based applications and securely accept crypto assets as payment. The company was founded in 2012 and is based in Wilmington, Delaware.","city":"Wilmington","state":"DE","country":"United States","website":"https://www.coinbase.com","address1":"1209 Orange Street","industry":"Software—Application","shortName":"Coinbase Global, Inc.","longName":"Coinbase Global, Inc.","symbol":"COIN","logo_url":"https://logo.clearbit.com/coinbase.com"}
{"zip":"300-78","sector":"Technology","longBusinessSummary":"Taiwan Semiconductor Manufacturing Company Limited manufactures and sells integrated circuits and semiconductors. It also offers customer service, account management, and engineering services. The company serves customers in computer, communications, consumer, and industrial and standard segments in North America, Europe, Japan, China, and South Korea. Taiwan Semiconductor Manufacturing Company Limited was founded in 1987 and is headquartered in HsinChu, Taiwan.","city":"Hsinchu City","phone":"886 3 563 6688","country":"Taiwan","website":"https://www.tsmc.com","address1":"Hsinchu Science Park","fax":"886 3 563 7000","industry":"Semiconductors","address2":"No. 8, Li-Hsin Road 6","shortName":"Taiwan Semiconductor Manufactur","longName":"Taiwan Semiconductor Manufacturing Company Limited","symbol":"TSM","logo_url":"https://logo.clearbit.com/tsmc.com"}
{"zip":"55403","sector":"Consumer Defensive","fullTimeEmployees": 409000,"longBusinessSummary":"Target Corporation operates as a general merchandise retailer in the United States. The company offers food assortments, including perishables, dry grocery, dairy, and frozen items; apparel, accessories, home dÃ©cor products, electronics, toys, seasonal offerings, food, and other merchandise; and beauty and household essentials. It also provides in-store amenities, such as Target CafÃ©, Target Optical, Starbucks, and other food service offerings. The company sells its products through its stores; and digital channels, including Target.com. As of January 30, 2021, the company operated approximately 1,897 stores. Target Corporation was founded in 1902 and is headquartered in Minneapolis, Minnesota.","city":"Minneapolis","phone":"612 304 6073","state":"MN","country":"United States","website":"https://corporate.target.com","address1":"1000 Nicollet Mall","industry":"Discount Stores","shortName":"Target Corporation","longName":"Target Corporation","symbol":"TGT","logo_url":"https://logo.clearbit.com/corporate.target.com"}
{"zip":"10022-7499","sector":"Consumer Defensive","fullTimeEmployees": 34200,"longBusinessSummary":"Colgate-Palmolive Company, together with its subsidiaries, manufactures and sells consumer products worldwide. The company operates through two segments, Oral, Personal and Home Care; and Pet Nutrition. The Oral, Personal and Home Care segment's products include toothpaste, toothbrushes, mouthwash, bar and liquid hand soaps, shower gels, shampoos, conditioners, deodorants and antiperspirants, skin health products, dishwashing detergents, fabric conditioners, household cleaners, and other similar items. This segment markets and sells its products to various retailers, wholesalers, and distributors. The Pet Nutrition segment offers pet nutrition products for everyday nutritional needs; and a range of therapeutic products to manage disease conditions in dogs and cats. This segment markets and sells its products through pet supply retailers, veterinarians, and eCommerce retailers. Its principal global and regional trademarks include Colgate, Palmolive, elmex, hello, meridol, Sorriso, Tom's of Maine, EltaMD, Filorga, Irish Spring, Lady Speed Stick, PCA Skin, Protex, Sanex, Softsoap, Speed Stick, Ajax, Axion, Fabuloso, Murphy, Soupline, and Suavitel, as well as Hill's Science Diet and Hill's Prescription Diet. The company has a strategic collaboration with Verily Life Sciences LLC to advance oral health research. Colgate-Palmolive Company was founded in 1806 and is headquartered in New York, New York.","city":"New York","phone":"212 310 2000","state":"NY","country":"United States","website":"https://www.colgatepalmolive.com","address1":"300 Park Avenue","industry":"Household & Personal Products","shortName":"Colgate-Palmolive Company","longName":"Colgate-Palmolive Company","symbol":"CL","logo_url":"https://logo.clearbit.com/colgatepalmolive.com"}
{"zip":"02895","sector":"Healthcare","fullTimeEmployees": 213000,"longBusinessSummary":"CVS Health Corporation provides health services in the United States. The company's Pharmacy Services segment offers pharmacy benefit management solutions, including plan design and administration, formulary management, retail pharmacy network management, mail order pharmacy, specialty pharmacy and infusion, clinical, and disease and medical spend management services. It serves employers, insurance companies, unions, government employee groups, health plans, prescription drug plans, Medicaid managed care plans, plans offered on public health insurance and private health insurance exchanges, other sponsors of health benefit plans, and individuals. This segment operates retail specialty pharmacy stores; and specialty mail order, mail order dispensing, and compounding pharmacies, as well as branches for infusion and enteral nutrition services. Its Retail/LTC segment sells prescription and over-the-counter drugs, consumer health and beauty products, and personal care products; and provides health care services through its MinuteClinic walk-in medical clinics. This segment also distributes prescription drugs; and provides related pharmacy consulting and other ancillary services to chronic care facilities and other care settings. As of December 31, 2020, it operated approximately 9,900 retail locations and 1,100 MinuteClinic locations, as well as online retail pharmacy websites, LTC pharmacies, and onsite pharmacies. The company's Health Care Benefits segment offers traditional, voluntary, and consumer-directed health insurance products and related services. It serves employer groups, individuals, college students, part-time and hourly workers, health plans, health care providers, governmental units, government-sponsored plans, labor groups, and expatriates. The company was formerly known as CVS Caremark Corporation and changed its name to CVS Health Corporation in September 2014. CVS Health Corporation was founded in 1963 and is headquartered in Woonsocket, Rhode Island.","city":"Woonsocket","phone":"401-765-1500","state":"RI","country":"United States","website":"https://www.cvshealth.com","address1":"One CVS Drive","industry":"Healthcare Plans","shortName":"CVS Health Corporation","longName":"CVS Health Corporation","symbol":"CVS","logo_url":"https://logo.clearbit.com/cvshealth.com"}
